exports.REGEX_USERNAME = /^[a-zA-Z0-9._]{4,20}$/;
exports.REGEX_PASSWORD = /((?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[\W]).{4,20})/;
exports.REGEX_EMAIL =
  /^[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?$/;
exports.REGEX_FULLNAME =
  /^([a-vxyỳọáầảấờễàạằệếýộậốũứĩõúữịỗìềểẩớặòùồợãụủíỹắẫựỉỏừỷởóéửỵẳẹèẽổẵẻỡơôưăêâđ]+)((\s{1}[a-vxyỳọáầảấờễàạằệếýộậốũứĩõúữịỗìềểẩớặòùồợãụủíỹắẫựỉỏừỷởóéửỵẳẹèẽổẵẻỡơôưăêâđ]+){1,})$/i;
exports.REGEX_PHONENUMBER = /^0[0-9]{9}$/;
